# Арифметические оператор "+" - сложение
print( 2 + 3) # ответ 5

# Арифметические оператор "-" - вычитание 
print( 10 - 3) # ответ 7

# Арифметические оператор "*" - умножение
print( 10 * 3) # ответ 30

# Арифметические оператор "/" - деление 
# ответ целое число 
print( 10 / 2) # ответ 5
# ответ дробное число
print( 3 / 2) # ответ 1.5

# Арифметические оператор "%" - деление по модулю
# с остатком
print( 3 % 2) # ответ 1
# без остатка
print( 30 % 2) # ответ 0

# Арифметические оператор "//" - Целочисленное деение
# количество делений
print( 3 // 2) # ответ 1
# количество делений
print( 30 // 2) # ответ 15

# вычитание из отрицательного числа
print(-5 -3) # ответ -8

# вазведение в степень числа 
print(5 ** 2) # ответ 25

# корень от числа числа 
print(25 ** 0.5) # ответ 5

# уровнение  
print(2 + 3 * 4) # ответ 14
print((2 + 3) * 4) # ответ 20

print(0.5 + 2) # ответ 2.5
print(0.1 + 0.2) # ответ 0.30000000000000004